const homeworkData = [
    {
        "id": "328",
        "grade": 4,
        "subject": "אנגלית",
        "task": "p. 10, ex. 8",
        "date": "08/09"
    },
    {
        "id": "219",
        "grade": 4,
        "subject": "מדעים",
        "task": "עמוד 12 מי שלא סיים בכיתה ",
        "date": "07/09"
    },
    {
        "id": "400",
        "grade": 4,
        "subject": "מדעים",
        "task": "עמוד 18",
        "date": "09/09"
    },
    {
        "id": "377",
        "grade": 4,
        "subject": "מתמטיקה",
        "task": "לסיים עד 86-87",
        "date": "09/09"
    },
    {
        "id": "29",
        "grade": 6,
        "subject": "מתמטיקה",
        "task": "משימה לבית במחברת ",
        "date": "02/09"
    },
    {
        "id": "59",
        "grade": 6,
        "subject": "מתמטיקה",
        "task": "תרגילים במחברת",
        "date": "03/09"
    },
    {
        "id": "61",
        "grade": 6,
        "subject": "מתמטיקה",
        "task": "מעגל ועיגול ",
        "date": "03/09"
    },
    {
        "id": "326",
        "grade": 6,
        "subject": "מתמטיקה",
        "task": "בחוברת עמודים 5-10",
        "date": "08/09"
    },
    {
        "id": "453",
        "grade": 6,
        "subject": "מתמטיקה",
        "task": "בחוברת עמודים 11-16",
        "date": "10/09"
    },
    {
        "id": "471",
        "grade": 6,
        "subject": "מתמטיקה",
        "task": "בחוברת עמודים 87-88",
        "date": "10/09"
    }
];