const homeworkData = [
    {
        "id": "328",
        "grade": 4,
        "subject": "אנגלית",
        "task": "p. 10, ex. 8",
        "date": "08/09"
    },
    {
        "id": "559",
        "grade": 4,
        "subject": "אנגלית",
        "task": "p. 16, 12, 13",
        "date": "15/09"
    },
    {
        "id": "219",
        "grade": 4,
        "subject": "מדעים",
        "task": "עמוד 12 מי שלא סיים בכיתה ",
        "date": "07/09"
    },
    {
        "id": "400",
        "grade": 4,
        "subject": "מדעים",
        "task": "עמוד 18",
        "date": "09/09"
    },
    {
        "id": "515",
        "grade": 4,
        "subject": "מדעים",
        "task": "עמוד 19",
        "date": "14/09"
    },
    {
        "id": "588",
        "grade": 4,
        "subject": "מדעים",
        "task": "עמוד 20",
        "date": "15/09"
    },
    {
        "id": "377",
        "grade": 4,
        "subject": "מתמטיקה",
        "task": "לסיים עד 86-87",
        "date": "09/09"
    },
    {
        "id": "545",
        "grade": 4,
        "subject": "מתמטיקה",
        "task": "עמ' 88-89",
        "date": "14/09"
    },
    {
        "id": "570",
        "grade": 6,
        "subject": "אנגלית",
        "task": "w. b.p. 4, 5",
        "date": "15/09"
    },
    {
        "id": "29",
        "grade": 6,
        "subject": "מתמטיקה",
        "task": "משימה לבית במחברת ",
        "date": "02/09"
    },
    {
        "id": "59",
        "grade": 6,
        "subject": "מתמטיקה",
        "task": "תרגילים במחברת",
        "date": "03/09"
    },
    {
        "id": "61",
        "grade": 6,
        "subject": "מתמטיקה",
        "task": "מעגל ועיגול ",
        "date": "03/09"
    },
    {
        "id": "326",
        "grade": 6,
        "subject": "מתמטיקה",
        "task": "בחוברת עמודים 5-10",
        "date": "08/09"
    },
    {
        "id": "453",
        "grade": 6,
        "subject": "מתמטיקה",
        "task": "בחוברת עמודים 11-16",
        "date": "10/09"
    },
    {
        "id": "471",
        "grade": 6,
        "subject": "מתמטיקה",
        "task": "בחוברת עמודים 87-88",
        "date": "10/09"
    },
    {
        "id": "513",
        "grade": 6,
        "subject": "מתמטיקה",
        "task": "עמודים 17-20 בחוברת",
        "date": "14/09"
    },
    {
        "id": "581",
        "grade": 6,
        "subject": "מתמטיקה",
        "task": "בחוברת עמודים 21-24",
        "date": "15/09"
    },
    {
        "id": "589",
        "grade": 6,
        "subject": "מתמטיקה",
        "task": "משימה במחברת",
        "date": "15/09"
    }
];