const homeworkData = [
    {
        "id": "480",
        "grade": 4,
        "subject": "אנגלית",
        "task": "p. 16",
        "date": "10/09"
    },
    {
        "id": "559",
        "grade": 4,
        "subject": "אנגלית",
        "task": "p. 16, 12, 13",
        "date": "15/09"
    },
    {
        "id": "718",
        "grade": 4,
        "subject": "אנגלית",
        "task": "p. 17",
        "date": "17/09"
    },
    {
        "id": "952",
        "grade": 4,
        "subject": "אנגלית",
        "task": "p. 21",
        "date": "06/10"
    },
    {
        "id": "1107",
        "grade": 4,
        "subject": "אנגלית",
        "task": "p. 23, 24",
        "date": "08/10"
    },
    {
        "id": "515",
        "grade": 4,
        "subject": "מדעים",
        "task": "עמוד 19",
        "date": "14/09"
    },
    {
        "id": "588",
        "grade": 4,
        "subject": "מדעים",
        "task": "עמוד 20",
        "date": "15/09"
    },
    {
        "id": "659",
        "grade": 4,
        "subject": "מדעים",
        "task": "21-23",
        "date": "16/09"
    },
    {
        "id": "1053",
        "grade": 4,
        "subject": "מדעים",
        "task": "שאלה מס' 1 עמוד 25 ",
        "date": "07/10"
    },
    {
        "id": "1096",
        "grade": 4,
        "subject": "מולדת",
        "task": "לסיים משימה במחברת ",
        "date": "08/10"
    },
    {
        "id": "545",
        "grade": 4,
        "subject": "מתמטיקה",
        "task": "עמ' 88-89",
        "date": "14/09"
    },
    {
        "id": "997",
        "grade": 4,
        "subject": "מתמטיקה",
        "task": "עבודה בכיתה עמ' 26-29",
        "date": "06/10"
    },
    {
        "id": "998",
        "grade": 4,
        "subject": "מתמטיקה",
        "task": "עבודה בכיתה עמ' 26-29",
        "date": "06/10"
    },
    {
        "id": "737",
        "grade": 4,
        "subject": "תרבות ישראל",
        "task": "עמוד 147 בספר- 3 שאלות",
        "date": "17/09"
    },
    {
        "id": "570",
        "grade": 6,
        "subject": "אנגלית",
        "task": "w. b.p. 4, 5",
        "date": "15/09"
    },
    {
        "id": "963",
        "grade": 6,
        "subject": "אנגלית",
        "task": "w. b. p. 8-9",
        "date": "06/10"
    },
    {
        "id": "453",
        "grade": 6,
        "subject": "מתמטיקה",
        "task": "בחוברת עמודים 11-16",
        "date": "10/09"
    },
    {
        "id": "471",
        "grade": 6,
        "subject": "מתמטיקה",
        "task": "בחוברת עמודים 87-88",
        "date": "10/09"
    },
    {
        "id": "513",
        "grade": 6,
        "subject": "מתמטיקה",
        "task": "עמודים 17-20 בחוברת",
        "date": "14/09"
    },
    {
        "id": "581",
        "grade": 6,
        "subject": "מתמטיקה",
        "task": "בחוברת עמודים 21-24",
        "date": "15/09"
    },
    {
        "id": "589",
        "grade": 6,
        "subject": "מתמטיקה",
        "task": "משימה במחברת",
        "date": "15/09"
    },
    {
        "id": "661",
        "grade": 6,
        "subject": "מתמטיקה",
        "task": "בחוברת עמודים 25-28",
        "date": "16/09"
    },
    {
        "id": "711",
        "grade": 6,
        "subject": "מתמטיקה",
        "task": "בחוברת גיאומטריה עמודים 89,91-93,95",
        "date": "17/09"
    },
    {
        "id": "990",
        "grade": 6,
        "subject": "מתמטיקה",
        "task": "בחוברת עמודים 30-34",
        "date": "06/10"
    },
    {
        "id": "1056",
        "grade": 6,
        "subject": "מתמטיקה",
        "task": "בחוברת עמודים 30-34",
        "date": "07/10"
    },
    {
        "id": "1097",
        "grade": 6,
        "subject": "מתמטיקה",
        "task": "מושגים המעגל והעיגול",
        "date": "08/10"
    },
    {
        "id": "1116",
        "grade": 6,
        "subject": "מתמטיקה",
        "task": "בחוברת עד עמוד 98 ",
        "date": "08/10"
    }
];