const homeworkData = [
    {
        "id": "952",
        "grade": 4,
        "subject": "אנגלית",
        "task": "p. 21",
        "date": "06/10"
    },
    {
        "id": "1107",
        "grade": 4,
        "subject": "אנגלית",
        "task": "p. 23, 24",
        "date": "08/10"
    },
    {
        "id": "1525",
        "grade": 4,
        "subject": "אנגלית",
        "task": "p. 32-33",
        "date": "15/10"
    },
    {
        "id": "1679",
        "grade": 4,
        "subject": "אנגלית",
        "task": "להשלים עבודת כיתה עמ' 34, 35",
        "date": "18/10"
    },
    {
        "id": "1053",
        "grade": 4,
        "subject": "מדעים",
        "task": "שאלה מס' 1 עמוד 25 ",
        "date": "07/10"
    },
    {
        "id": "1405",
        "grade": 4,
        "subject": "מדעים",
        "task": "עמודים 26-27",
        "date": "13/10"
    },
    {
        "id": "1458",
        "grade": 4,
        "subject": "מדעים",
        "task": "חיות מבויתות עמודים 28-29",
        "date": "14/10"
    },
    {
        "id": "1096",
        "grade": 4,
        "subject": "מולדת",
        "task": "לסיים משימה במחברת ",
        "date": "08/10"
    },
    {
        "id": "997",
        "grade": 4,
        "subject": "מתמטיקה",
        "task": "עבודה בכיתה עמ' 26-29",
        "date": "06/10"
    },
    {
        "id": "998",
        "grade": 4,
        "subject": "מתמטיקה",
        "task": "עבודה בכיתה עמ' 26-29",
        "date": "06/10"
    },
    {
        "id": "1646",
        "grade": 4,
        "subject": "מתמטיקה",
        "task": "עמ' -4-10",
        "date": "18/10"
    },
    {
        "id": "963",
        "grade": 6,
        "subject": "אנגלית",
        "task": "w. b. p. 8-9",
        "date": "06/10"
    },
    {
        "id": "1374",
        "grade": 6,
        "subject": "אנגלית",
        "task": "w. b. p. 10-12",
        "date": "13/10"
    },
    {
        "id": "1607",
        "grade": 6,
        "subject": "אנגלית",
        "task": "משימות בגלים",
        "date": "16/10"
    },
    {
        "id": "990",
        "grade": 6,
        "subject": "מתמטיקה",
        "task": "בחוברת עמודים 30-34",
        "date": "06/10"
    },
    {
        "id": "1056",
        "grade": 6,
        "subject": "מתמטיקה",
        "task": "בחוברת עמודים 30-34",
        "date": "07/10"
    },
    {
        "id": "1097",
        "grade": 6,
        "subject": "מתמטיקה",
        "task": "מושגים המעגל והעיגול",
        "date": "08/10"
    },
    {
        "id": "1116",
        "grade": 6,
        "subject": "מתמטיקה",
        "task": "בחוברת עד עמוד 98 ",
        "date": "08/10"
    },
    {
        "id": "1314",
        "grade": 6,
        "subject": "מתמטיקה",
        "task": "משימה במחברת + בחוברת עמודים 68-68",
        "date": "12/10"
    },
    {
        "id": "1394",
        "grade": 6,
        "subject": "מתמטיקה",
        "task": "בחוברת עמודים 69-76",
        "date": "13/10"
    },
    {
        "id": "1459",
        "grade": 6,
        "subject": "מתמטיקה",
        "task": "בחוברת עמודים 39-43",
        "date": "14/10"
    },
    {
        "id": "1517",
        "grade": 6,
        "subject": "מתמטיקה",
        "task": "משימה במחברת",
        "date": "15/10"
    },
    {
        "id": "1553",
        "grade": 6,
        "subject": "מתמטיקה",
        "task": "בחוברת עמודים 101,103-104,106-108",
        "date": "15/10"
    }
];